BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega3209.PIC
        <edc:SFRDef edc:_addr="0xAB9" edc:access="nnnnnnnn" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCB3"/>
        <edc:SFRDef edc:_addr="0xABA" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNT" edc:nzwidth="0x10" ltx:memberofperipheral="TCB3"/>
        <edc:SFRDef edc:_addr="0xABC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="CCMP" edc:nzwidth="0x10" ltx:memberofperipheral="TCB3"/>
        <edc:AdjustPoint edc:_addr="0xABE" edc:offset="0x443"/>
        <edc:SFRDef edc:_addr="0xF01" edc:access="nnnnnnnn" edc:cname="REVID" edc:nzwidth="0x8" ltx:memberofperipheral="SYSCFG"/>
        <edc:SFRDef edc:_addr="0xF02" edc:access="-------n" edc:cname="EXTBRK" edc:nzwidth="0x8" ltx:memberofperipheral="SYSCFG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ENEXTBRK" edc:desc="External break enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF03" edc:offset="0x15"/>
        <edc:SFRDef edc:_addr="0xF18" edc:access="nnnnnnnn" edc:cname="OCDM" edc:nzwidth="0x8" ltx:memberofperipheral="SYSCFG"/>
        <edc:SFRDef edc:_addr="0xF19" edc:access="-------n" edc:cname="OCDMS" edc:nzwidth="0x8" ltx:memberofperipheral="SYSCFG">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OCDMR" edc:desc="OCD Message Read" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xF1A" edc:offset="0xE6"/>
        <edc:SFRDef edc:_addr="0x1000" edc:access="-----nnn" edc:cname="CTRLA" edc:nzwidth="0x8" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x3">
                <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="PAGEWRITE" edc:desc="Write page" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="PAGEERASE" edc:desc="Erase page" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="PAGEERASEWRITE" edc:desc="Erase and write page" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="PAGEBUFCLR" edc:desc="Page buffer clear" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="CHIPERASE" edc:desc="Chip erase" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="EEERASE" edc:desc="EEPROM erase" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="FUSEWRITE" edc:desc="Write fuse (PDI only)" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1001" edc:access="------nn" edc:cname="CTRLB" edc:nzwidth="0x8" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="APCWP" edc:desc="Application code write protect" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOOTLOCK" edc:desc="Boot Lock" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1002" edc:access="-----rrr" edc:cname="STATUS" edc:nzwidth="0x8" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FBUSY" edc:desc="Flash busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEBUSY" edc:desc="EEPROM busy" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERROR" edc:desc="Write error" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1003" edc:access="-------n" edc:cname="INTCTRL" edc:nzwidth="0x8" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1004" edc:access="-------n" edc:cname="INTFLAGS" edc:nzwidth="0x8" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x1005" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x1006" edc:access="nnnnnnnnnnnnnnnn" edc:cname="DATA" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL"/>
        <edc:SFRDef edc:_addr="0x1008" edc:access="nnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:beginaddr="0x4000" edc:endaddr="0xC000" edc:regionid="MAPPED_PROGMEM"/>
    </edc:RegardlessOfMode>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0_ALT"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="TCA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS_ALT"/>
      <edc:VirtualPin edc:name="LUT0_OUT0" edc:ppsfunction="CCL_ALT"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB2"/>
      <edc:VirtualPin edc:name="EVOUT1" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="TCA_ALT"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB3"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="TCA_ALT"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART3_ALT"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB2_ALT"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART3_ALT"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB3"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="TCA_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="LUT1_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCA_ALT2"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1"/>
      <edc:VirtualPin edc:name="LUT1_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB3_ALT"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="TCA_ALT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT1_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C_ALT"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="TCA_ALT2"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C_ALT"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI_ALT"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="TCA_ALT2"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC4"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1_ALT"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="TCA_ALT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC5"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1_ALT"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="TCA_ALT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC6"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC7"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS_ALT"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT2_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="TCA_ALT3"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT2_OUT1" edc:ppsfunction="CCL_ALT"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS_ALT"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC0"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AGND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0"/>
      <edc:VirtualPin edc:name="AIN8" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE1"/>
      <edc:VirtualPin edc:name="AIN9" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT4" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3"/>
      <edc:VirtualPin edc:name="AIN11" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI_ALT2"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="TCA_ALT4"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF0"/>
      <edc:VirtualPin edc:name="LUT3_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TOSC1" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART2"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF1"/>
      <edc:VirtualPin edc:name="LUT3_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART2"/>
      <edc:VirtualPin edc:name="TOSC2" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF2"/>
      <edc:VirtualPin edc:name="AIN12" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="EVOUT5" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT3_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C_ALT2"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="TCA_ALT5"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF3"/>
      <edc:VirtualPin edc:name="AIN13" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="LUT3_OUT1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C_ALT2"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="TCA_ALT5"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF4"/>
      <edc:VirtualPin edc:name="AIN14" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART2_ALT"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB0_ALT"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF5"/>
      <edc:VirtualPin edc:name="AIN15" edc:ppsfunction="AIN0"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART2_ALT"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB1_ALT"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="TCA_ALT5"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF6"/>
      <edc:VirtualPin edc:name="LUT3_OUT1" edc:ppsfunction="CCL_ALT"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RESET" edc:ppsfunction="OTHER"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART2_ALT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="UPDI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0"/>
      <edc:VirtualPin edc:name="CLKI" edc:ppsfunction="CLKCTRL"/>
      <edc:VirtualPin edc:name="LUT0_IN0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="LUT0_IN1" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="TCA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS"/>
      <edc:VirtualPin edc:name="LUT0_IN2" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB0"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="TCA"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="LUT0_OUT0" edc:ppsfunction="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="TCB1"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="TCA"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0_ALT"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="TCA"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>